In [1]:
import pandas as pd

In [2]:
 pop = {'Nevada': {2001: 2.4, 2002: 2.9},
 ....: 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [3]:
pop

{'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [4]:
frame3=pd.DataFrame(pop)

In [5]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [6]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [7]:
pd.DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [8]:
pdata = {'Ohio': frame3['Ohio'][:-1],
 ....: 'Nevada': frame3['Nevada'][:2]}

In [9]:
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [10]:
a=[1,2,3,4,5]
a[:-2]

[1, 2, 3]

In [11]:
frame3.index.name = 'year'; frame3.columns.name = 'state'

In [12]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [13]:
frame3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

In [14]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])

In [15]:
frame4=pd.DataFrame(obj)

In [16]:
frame4

   0
a  0
b  1
c  2

In [17]:
index = obj.index

In [18]:
index

Index(['a', 'b', 'c'], dtype='object')

In [19]:
import  numpy as np

In [20]:
labels = pd.Index(np.arange(3))

In [21]:
labels

Int64Index([0, 1, 2], dtype='int64')

In [22]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)

In [23]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [24]:
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])

In [25]:
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

# 5.2 Essential Functionality

In [26]:
 obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])

In [27]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [28]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])

In [29]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [30]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])

In [31]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [32]:
obj3.reindex(range(10), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
6    yellow
7    yellow
8    yellow
9    yellow
dtype: object

In [33]:
obj3.reindex(range(10),method='bfill')

0      blue
1    purple
2    purple
3    yellow
4    yellow
5       NaN
6       NaN
7       NaN
8       NaN
9       NaN
dtype: object

In [34]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
 ....: index=['a', 'c', 'd'],
 ....: columns=['Ohio', 'Texas', 'California'])

In [35]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [36]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])

In [37]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [38]:
states = ['Texas', 'Utah', 'California']

In [39]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [40]:
frame.loc[['a', 'b', 'c', 'd'], states]

D:\anaconda\lib\site-packages\pandas\core\indexing.py:1494: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  return self._getitem_tuple(key)

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [41]:
frame.limit()

AttributeError: 'DataFrame' object has no attribute 'limit'

In [ ]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])

In [42]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [43]:
new_obj = obj.drop('c')

In [44]:
new_obj

d    4.5
b    7.2
a   -5.3
dtype: float64

In [45]:
new_obj = obj.drop(['c','d'])

In [46]:
new_obj

b    7.2
a   -5.3
dtype: float64

In [47]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
 .....: index=['Ohio', 'Colorado', 'Utah', 'New York'],
 .....: columns=['one', 'two', 'three', 'four'])

In [48]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [49]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [50]:
data.drop('New York')

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11

In [51]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [52]:
data.drop('Ohio', axis=0)

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [53]:
 data.drop(['two', 'four'], axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [54]:
data.drop(['two','four'],axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [56]:
data.drop(['Ohio','Utah'],axis='rows')

          one  two  three  four
Colorado    4    5      6     7
New York   12   13     14    15

In [57]:
obj.drop('c', inplace=True)

In [58]:
obj

d    4.5
b    7.2
a   -5.3
dtype: float64

In [60]:
obj.drop('d', inplace=False)

b    7.2
a   -5.3
dtype: float64

In [61]:
obj

d    4.5
b    7.2
a   -5.3
dtype: float64

In [62]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

# Indexing, Selection, and Filtering

In [63]:
 obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])

In [64]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [65]:
obj[1]

1.0

In [67]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [68]:
obj[3:4]

d    3.0
dtype: float64

In [71]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [72]:
 obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [75]:
 obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [76]:
obj[1]

1.0

In [78]:
obj[obj <= 2]

a    0.0
b    1.0
c    2.0
dtype: float64

In [79]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [80]:
obj['b':'c'] = 5

In [81]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [82]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
 .....: index=['Ohio', 'Colorado', 'Utah', 'New York'],
 .....: columns=['one', 'two', 'three', 'four'])

In [83]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [84]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [88]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [90]:
data[['three','one','two']]

          three  one  two
Ohio          2    0    1
Colorado      6    4    5
Utah         10    8    9
New York     14   12   13

In [91]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [92]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [95]:
data[data['three'] < 5]

      one  two  three  four
Ohio    0    1      2     3

In [96]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [97]:
data[data < 5] = 0

In [98]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [99]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [100]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [101]:
data.loc['Utah',['one','two','three']]

one       8
two       9
three    10
Name: Utah, dtype: int32

In [116]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [102]:
 data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [103]:
data.iloc[3,[3,2,1]]

four     15
three    14
two      13
Name: New York, dtype: int32

In [104]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [105]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [106]:
data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [117]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [108]:
data.loc[:'Utah', 'one']

Ohio        0
Colorado    0
Utah        8
Name: one, dtype: int32

In [109]:
data.loc[:'New York', 'two']

Ohio         0
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [111]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [127]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [142]:
data.iloc[:, :4][data.two > 5]

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [143]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [145]:
data.iloc[:,:4][data.one >0]

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [147]:
data.iloc[:,:4][data.four >10]

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [149]:
data.iloc[:,:4][data.three < 6]

      one  two  three  four
Ohio    0    0      0     0

In [150]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [151]:
data.iloc[:,:4][data.one>0]

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [152]:
data.iloc[:,:4][data.two >5]

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [2]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])

In [3]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [4]:
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],
 .....: index=['a', 'c', 'e', 'f', 'g'])

In [5]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [6]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [9]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [8]:
s1.iloc[:1]

a    7.3
dtype: float64

# Arithmetic and Data Alignment

In [10]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])

In [11]:
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],
 .....: index=['a', 'c', 'e', 'f', 'g'])

In [12]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [13]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [15]:
import numpy as np

In [16]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
 .....: index=['Ohio', 'Texas', 'Colorado'])

In [17]:
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
 .....: index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [18]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [19]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [21]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [22]:
df1 = pd.DataFrame({'A': [1, 2]})

In [23]:
df1

   A
0  1
1  2

In [25]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
 .....: columns=list('abcd'))

In [27]:
 df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
 .....: columns=list('abcde'))

In [28]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [29]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [30]:
df2.loc[1, 'b'] = np.nan

In [31]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [32]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [34]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [35]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [39]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [40]:
1 / df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [41]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [44]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [46]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [47]:
df1.floordiv(2)

     a    b    c    d
0  0.0  0.0  1.0  1.0
1  2.0  2.0  3.0  3.0
2  4.0  4.0  5.0  5.0

In [48]:
df1.mul(1)

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [49]:
df1.rmul(2)

      a     b     c     d
0   0.0   2.0   4.0   6.0
1   8.0  10.0  12.0  14.0
2  16.0  18.0  20.0  22.0

In [54]:
df1.pow(2)

      a     b      c      d
0   0.0   1.0    4.0    9.0
1  16.0  25.0   36.0   49.0
2  64.0  81.0  100.0  121.0

In [55]:
arr = np.arange(12.).reshape((3, 4))

In [56]:
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [58]:
arr[0]

array([0., 1., 2., 3.])

In [57]:
arr-arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [59]:
 frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
 .....: columns=list('bde'),
 .....: index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [60]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [69]:
series=frame.iloc[0]

In [70]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [72]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [73]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [74]:
series2 = pd.Series(range(3), index=['b', 'e', 'f'])

In [77]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [75]:
series2

b    0
e    1
f    2
dtype: int64

In [76]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [80]:
series3 = frame['d']

In [81]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [83]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [82]:
frame.sub(series3, axis='index')

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [85]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
 .....: index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [86]:
frame

               b         d         e
Utah    0.006343  1.143622  1.202951
Ohio    1.255050  0.153195 -1.247587
Texas  -1.938625 -1.832620 -1.508309
Oregon  2.226945 -0.948068 -1.265439

In [87]:
np.abs(frame)

               b         d         e
Utah    0.006343  1.143622  1.202951
Ohio    1.255050  0.153195  1.247587
Texas   1.938625  1.832620  1.508309
Oregon  2.226945  0.948068  1.265439

In [88]:
f = lambda x: x.max() - x.min()

In [91]:
frame.apply(f)

b    4.165570
d    2.976241
e    2.711260
dtype: float64

In [94]:
frame.apply(f, axis='columns')

Utah      1.196608
Ohio      2.502637
Texas     0.430316
Oregon    3.492384
dtype: float64

In [97]:
format = lambda x: '%.f' % x

In [98]:
frame.applymap(format)

         b   d   e
Utah     0   1   1
Ohio     1   0  -1
Texas   -2  -2  -2
Oregon   2  -1  -1

# Sorting and Ranking

In [103]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])

In [104]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [106]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
 .....: index=['three', 'one'],
 .....: columns=['d', 'a', 'b', 'c'])

In [107]:
 frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [108]:
obj = pd.Series([4, 7, -3, 2])

In [109]:
obj

0    4
1    7
2   -3
3    2
dtype: int64

In [110]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [111]:
 frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})

In [112]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [113]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [114]:
frame.sort_values(by=['a', 'b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [10]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])

In [11]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [12]:
obj = pd.Series([7,3,4,5,6,3,7])
obj.rank(ascending=1)

0    6.5
1    1.5
2    3.0
3    4.0
4    5.0
5    1.5
6    6.5
dtype: float64

In [13]:
obj.rank(method='first')

0    6.0
1    1.0
2    3.0
3    4.0
4    5.0
5    2.0
6    7.0
dtype: float64

In [2]:
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
 .....: 'c': [-2, 5, 8, -2.5]})

In [3]:
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [4]:
frame.rank(axis='columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [5]:
frame.rank(axis='rows')

     b    a    c
0  3.0  1.5  2.0
1  4.0  3.5  3.0
2  1.0  1.5  4.0
3  2.0  3.5  1.0

# Axis Indexes with Duplicate Labels

In [14]:
 obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [15]:
obj.index.is_unique

False

In [16]:
obj['a']

a    0
a    1
dtype: int64

In [17]:
obj['c']

4

In [19]:
import numpy as np

In [20]:
df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])

In [21]:
df

          0         1         2
a  1.343372  1.249751  0.101897
a  1.272662  0.715526  0.237147
b -0.754665 -1.315837  0.053644
b -3.310556 -0.727842 -0.203012

In [22]:
 df.loc['b']

          0         1         2
b -0.754665 -1.315837  0.053644
b -3.310556 -0.727842 -0.203012

# 5.3 Summarizing and Computing Descriptive Statistics

In [23]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
 .....: [np.nan, np.nan], [0.75, -1.3]],
 .....: index=['a', 'b', 'c', 'd'],
 .....: columns=['one', 'two'])

In [24]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [25]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [26]:
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [29]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [27]:
df.mean(axis='columns', skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [28]:
df.mean(axis='columns', skipna=True)

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [31]:
df.mean(axis='rows',skipna=True)

one    3.083333
two   -2.900000
dtype: float64

In [33]:
df.mean(axis='rows',skipna=False)

one   NaN
two   NaN
dtype: float64

In [35]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [34]:
df.idxmax()

one    b
two    d
dtype: object

In [36]:
df.idxmin()

one    d
two    b
dtype: object

In [37]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [38]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [39]:
obj = pd.Series(['a', 'a', 'b', 'c'] * 4)

In [40]:
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [41]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [49]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [42]:
df.diff()

   one  two
a  NaN  NaN
b  5.7  NaN
c  NaN  NaN
d  NaN  NaN

In [44]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [43]:
df.quantile()

one    1.4
two   -2.9
Name: 0.5, dtype: float64

In [56]:
df.quantile(.2,axis=1)

a    1.40
b   -2.18
c     NaN
d   -0.89
Name: 0.2, dtype: float64

In [46]:
df.median()

one    1.4
two   -2.9
dtype: float64

In [47]:
df.mad()

one    2.677778
two    1.600000
dtype: float64

In [48]:
df.var()

one    12.205833
two     5.120000
dtype: float64

In [50]:
df.pct_change()

        one       two
a       NaN       NaN
b  4.071429       NaN
c  0.000000  0.000000
d -0.894366 -0.711111

In [51]:
df.prod()

one    7.455
two    5.850
dtype: float64

In [52]:
df.cummin()

    one  two
a  1.40  NaN
b  1.40 -4.5
c   NaN  NaN
d  0.75 -4.5

In [53]:
df.cummax()

   one  two
a  1.4  NaN
b  7.1 -4.5
c  NaN  NaN
d  7.1 -1.3

In [54]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [58]:
import pandas_datareader.data as web
all_data = {ticker: web.get_data_yahoo(ticker)
 for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}

In [12]:
from numpy import nan as NA #chapter7

In [60]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [61]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [62]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [63]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [65]:
data.isnull()

0    False
1     True
2    False
3     True
4    False
dtype: bool

In [67]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
 ....: [NA, NA, NA], [NA, 6.5, 3.]])

In [68]:
cleaned = data.dropna()

In [69]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [70]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [71]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [72]:
data[4] = NA

In [73]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [75]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [76]:
df = pd.DataFrame(np.random.randn(7, 3))

In [77]:
df

          0         1         2
0 -3.093563  1.512603  0.148111
1  1.116349  0.208969  2.109565
2  0.834475 -0.845898 -1.425424
3 -1.227532  0.050793  0.538109
4  0.656127  1.777797 -0.001839
5  1.509283  2.160431  1.168813
6  0.380671  0.478554 -0.024499

In [78]:
 df.iloc[:4, 1] = NA

In [79]:
df

          0         1         2
0 -3.093563       NaN  0.148111
1  1.116349       NaN  2.109565
2  0.834475       NaN -1.425424
3 -1.227532       NaN  0.538109
4  0.656127  1.777797 -0.001839
5  1.509283  2.160431  1.168813
6  0.380671  0.478554 -0.024499

In [80]:
df.iloc[:2, 2] = NA

In [81]:
df

          0         1         2
0 -3.093563       NaN       NaN
1  1.116349       NaN       NaN
2  0.834475       NaN -1.425424
3 -1.227532       NaN  0.538109
4  0.656127  1.777797 -0.001839
5  1.509283  2.160431  1.168813
6  0.380671  0.478554 -0.024499

In [83]:
df.dropna(how="all")

          0         1         2
0 -3.093563       NaN       NaN
1  1.116349       NaN       NaN
2  0.834475       NaN -1.425424
3 -1.227532       NaN  0.538109
4  0.656127  1.777797 -0.001839
5  1.509283  2.160431  1.168813
6  0.380671  0.478554 -0.024499

In [85]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [97]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [7]:
import numpy as np
df = pd.DataFrame(np.random.randn(7, 3))

In [13]:
 df.iloc[:4, 1] = NA

In [14]:
df.iloc[:2, 2] = NA

In [15]:
df

          0         1         2
0  1.005219       NaN       NaN
1 -0.151471       NaN       NaN
2  0.307192       NaN -0.829629
3  0.759714       NaN  1.371344
4 -2.558009 -0.227629  0.744008
5  0.374547 -0.330859  0.473169
6 -0.723283 -1.274311 -1.589758

In [104]:
df.dropna()

          0         1         2
4 -0.461626 -1.881843 -0.142827
5 -0.156305  1.283554 -0.774186
6  0.384587 -1.149553 -0.538189

In [18]:
df.dropna(thresh=3)

          0         1         2
4 -2.558009 -0.227629  0.744008
5  0.374547 -0.330859  0.473169
6 -0.723283 -1.274311 -1.589758

# Filling In Missing Data

In [111]:
df.fillna(0)

          0         1         2
0  0.556722  0.000000  0.000000
1 -2.298278  0.000000  0.000000
2 -0.908841  0.000000 -0.720325
3  0.181829  0.000000 -0.428475
4 -0.461626 -1.881843 -0.142827
5 -0.156305  1.283554 -0.774186
6  0.384587 -1.149553 -0.538189

In [20]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  1.005219  0.500000  0.000000
1 -0.151471  0.500000  0.000000
2  0.307192  0.500000 -0.829629
3  0.759714  0.500000  1.371344
4 -2.558009 -0.227629  0.744008
5  0.374547 -0.330859  0.473169
6 -0.723283 -1.274311 -1.589758

In [22]:
df.fillna({1:0})

          0         1         2
0  1.005219  0.000000       NaN
1 -0.151471  0.000000       NaN
2  0.307192  0.000000 -0.829629
3  0.759714  0.000000  1.371344
4 -2.558009 -0.227629  0.744008
5  0.374547 -0.330859  0.473169
6 -0.723283 -1.274311 -1.589758

In [113]:
_ = df.fillna(0, inplace=True)

In [115]:
df

          0         1         2
0  0.556722  0.000000  0.000000
1 -2.298278  0.000000  0.000000
2 -0.908841  0.000000 -0.720325
3  0.181829  0.000000 -0.428475
4 -0.461626 -1.881843 -0.142827
5 -0.156305  1.283554 -0.774186
6  0.384587 -1.149553 -0.538189

In [133]:
df = pd.DataFrame(np.random.randn(6, 3))

In [23]:
db= pd.DataFrame(np.random.randn(6, 3))

In [24]:
db

          0         1         2
0 -0.804936 -0.371356 -0.422782
1  0.294983 -2.538098  1.265358
2 -0.573314 -1.081830  0.061768
3  0.524626  0.379225 -0.152894
4 -1.563263  0.005805  0.498560
5 -1.352633 -1.118579 -0.939763

In [29]:
db.iloc[2:, 1] = NA

In [27]:
db.iloc[4:, 2] = NA

In [30]:
db

          0         1         2
0 -0.804936 -0.371356 -0.422782
1  0.294983 -2.538098  1.265358
2 -0.573314       NaN  0.061768
3  0.524626       NaN -0.152894
4 -1.563263       NaN       NaN
5 -1.352633       NaN       NaN

In [134]:
df

          0         1         2
0  0.502239 -3.516690 -3.007970
1 -0.481946  0.019647 -0.866347
2 -0.994991  0.835574 -0.679952
3  1.134487  0.902563 -0.685797
4  0.225757 -1.848984 -0.931487
5 -0.659390 -0.491952  0.168977

In [135]:
df.iloc[2:, 1] = NA

In [136]:
df.iloc[4:, 2] = NA

In [137]:
df

          0         1         2
0  0.502239 -3.516690 -3.007970
1 -0.481946  0.019647 -0.866347
2 -0.994991       NaN -0.679952
3  1.134487       NaN -0.685797
4  0.225757       NaN       NaN
5 -0.659390       NaN       NaN

In [138]:
df.fillna(method='ffill')

          0         1         2
0  0.502239 -3.516690 -3.007970
1 -0.481946  0.019647 -0.866347
2 -0.994991  0.019647 -0.679952
3  1.134487  0.019647 -0.685797
4  0.225757  0.019647 -0.685797
5 -0.659390  0.019647 -0.685797

In [139]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.502239 -3.516690 -3.007970
1 -0.481946  0.019647 -0.866347
2 -0.994991  0.019647 -0.679952
3  1.134487  0.019647 -0.685797
4  0.225757       NaN -0.685797
5 -0.659390       NaN -0.685797

In [31]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [32]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [33]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [42]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [38]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [ ]:
data.fillna

# 7.2 Data Transformation

# Removing Duplicates

In [43]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
 ....: 'k2': [1, 1, 2, 3, 3, 4, 4]})

In [44]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [45]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [46]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [47]:
data['v1'] = range(7)

In [52]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [53]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [54]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [56]:
data.drop_duplicates(['k1'],keep='last')

    k1  k2  v1
4  one   3   4
6  two   4   6

# Transforming Data Using a Function or Mapping

In [72]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
 ....: 'Pastrami', 'corned beef', 'Bacon',
 ....: 'pastrami', 'honey ham', 'nova lox'],
 ....: 'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [73]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [74]:
meat_to_animal = {
 'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'
}

In [75]:
lowercased = data['food'].str.lower()

In [76]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [77]:
data['animal'] = lowercased.map(meat_to_animal)

In [63]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

TypeError: ("unsupported operand type(s) for -: 'str' and 'str'", 'occurred at index food')